{
  "_class_name": "UNet2DModel",
  "_diffusers_version": "0.17.1",
  "_name_or_path": "/a/home/cc/students/cs/giladd/.cache/huggingface/hub/models--nabdan--mnist_20_epoch/snapshots/ab202304f11b935b5ba72982bcef263cb2ab1054",
  "act_fn": "silu",
  "add_attention": true,
  "attention_head_dim": 8,
  "block_out_channels": [
    32,
    64,
    64
  ],
  "center_input_sample": false,
  "class_embed_type": null,
  "down_block_types": [
    "DownBlock2D",
    "AttnDownBlock2D",
    "AttnDownBlock2D"
  ],
  "downsample_padding": 1,
  "flip_sin_to_cos": true,
  "freq_shift": 0,
  "in_channels": 1,
  "layers_per_block": 2,
  "mid_block_scale_factor": 1,
  "norm_eps": 1e-05,
  "norm_num_groups": 32,
  "num_class_embeds": null,
  "out_channels": 1,
  "resnet_time_scale_shift": "default",
  "sample_size": 28,
  "time_embedding_type": "positional",
  "up_block_types": [
    "AttnUpBlock2D",
    "AttnUpBlock2D",
    "UpBlock2D"
  ]
}
